#include <stdio.h>
int main (void)
{
	char v[30],i;char ch[30];
	int A0 = 0,A1 = 0;
	int B0 = 0,B1 = 0;
	int C0 = 0,C1 = 0;
	int D0 = 0,D1 = 0;
	printf ("1、 关于人生观，我的内心其实是：\n");
	printf("A、希望能够有尽量多的人生体验，所以会有多样化的想法.\nB、在合理的基础上，谨慎确定目标，一旦确定会坚定不移地去做。\n C、更加注重的是取得一切有可能的成就。\n D、宁愿剔除风险而享受平静或现状。\n");
	scanf ("%c",&v[0]);
	scanf("%c",&ch[0]);
	printf ("your choice is %c\n",v[0]);
	printf ("2、如果爬山旅游，在下山回来的路线选择上，我更在乎： 　\n");
	printf ("A、好玩有趣，所以宁愿新路线回巢。\nB、安全稳妥，所以宁愿原路线返回。\n C、挑战困难，所以宁愿新路线回巢。\nD、方便省心，所以宁愿原路线返回\n");
	scanf ("%c",&v[1]);
	scanf ("%c",&ch[1]);
	printf ("your choice is %c\n",v[1]);
	printf ("3、 在表达一个观点时，我更看重\n");
	printf ("A、感觉效果。有时可能会显得夸张。 \nB、达成结果。有时可能太直接让别人很不高兴。\n C、人际感受。有时可能会不好意思讲真话。\n D、说话后周围的人际感受是否舒服。\n");
	scanf ("%c",&v[2]);
	scanf ("%c",&ch[2]);
	printf ("your choice is %c\n",v[2]);
	printf ("4、 在大多数时候，我的内心更想要：\n");
	printf ("A、刺激。经常冒出新点子，想做就做，喜欢与众不同。\n B、安全。头脑冷静，不易冲动。\nC、挑战。生命中竞赛随处可见，有强烈的“赢”的欲望。\n D、稳定。满足自己所拥有的，很少羡慕别人。	\n");
	scanf ("%c",&v[3]);
	scanf ("%c",&ch[3]);
	printf ("your choice is %c\n",v[3]);
	printf ("5、 我认为自己在情感上的基本特点是： 　\n");
	printf ("A、情绪多变，经常波动。 \n　B、外表自我抑制强，但内心感情起伏大，一旦挫伤难以平复。\n 　C、感情不拖泥带水，只是一旦不稳定，容易激动和发怒。\nD、天性情绪四平八稳。\n");
	scanf ("%c",&v[4]);
	scanf ("%c",&ch[4]);
	printf ("your choice is %c\n",v[4]);
	printf ("6、 我认为自己除了工作外，在控制欲上面，我：\n");
	printf ("A、没有控制欲，只有感染带动他人的欲望，但自控能力不算强。\n B、用规则来保持我对自己的控制和对他人的要求.\nC、内心是有控制欲和希望别人服从我的.\nD、没兴趣影响别人，也不愿别人来控制我\n");
	scanf ("%c",&v[5]);
	scanf ("%c",&ch[5]);
	printf ("your choice is %c\n",v[5]);
	printf ("7、 当与情人交往时，我最希望对方：\n");
	printf ("A、经常赞美我，让我非常开心、被关怀且自由。 \nB、可猜到我内心所想，对我的需求很敏感。\nC、得到对方的认可，我是对的并且是有价值的。\n　D、尊重并且相处静谧的。\n");
	scanf ("%c",&v[6]);
	scanf ("%c",&ch[6]);
	printf ("your choice is %c\n",v[6]);
	printf ("8、 在人际交往时，我：\n");
	printf ("A、喜欢交很多朋友，与人交往很有趣。\n B、非常审慎缓慢地进入，一旦认为是朋友，便长久地维持。\n C、希望在人际关系中占据主导地位。\nD、顺其自然，不温不火，相对被动。\n");
	scanf ("%c",&v[7]);
	scanf ("%c",&ch[7]);
	printf ("your choice is %c\n",v[7]);
	printf ("9、 我做事情，大多数时候是： \n");
	printf ("A、缺少长性，不喜欢长期做相同无变化的事情。 \n　B、缺少果断，期待最好的结果但总能先看到事情的不利面。\n 　C、缺少耐性，有时行事过于草率。\nD、缺少紧迫，行动偏缓，难下决心。\n");
	scanf ("%c",&v[8]);
	scanf ("%c",&ch[8]);
	printf ("your choice is %c\n",v[8]);
	printf ("10、 通常我完成任务的方式是： 　\n");
	printf ("A、经常会赶在最后期限前完成。\nB、自己做，精确地做，不要麻烦别人。\n C、先做，快速做.\nD、使用传统的方法，需要时从他人处得到帮忙。\n");
	scanf ("%c",&v[9]);
	scanf ("%c",&ch[9]);
	printf ("your choice is %c\n",v[9]);
	printf ("11、 如果有人深深惹恼我时，我： 　\n");
	printf ("A、内心感到受伤，认为没有原谅的可能，可最终很多时候还是会原谅对方。\n B、深深感到愤怒，如此之深怎可忘记？我会牢记，同时未来完全避开那个家伙。\n C、会火冒三丈，并且内心期望有机会狠狠地回应打击。\nD、我会避免摊牌，因为那还不到那个地步，那个人多行不义必自毙，或者自己再去找新朋友.\n");
	scanf ("%c",&v[10]);
	scanf ("%c",&ch[10]);
	printf ("your choice is %c\n",v[10]);
	printf ("12、 在人际关系中，我最在意的是： 　\n");
	printf ("A、得到他人的赞美和欢迎。\nB、得到他人的理解和欣赏.\nC、得到他人的感激和尊敬.\nD、得到他人的尊重和接纳.\n");
	scanf ("%c",&v[11]);
	scanf ("%c",&ch[11]);
	printf ("your choice is %c\n",v[11]);
	printf ("13、在工作上，我表现出来更多的是：\n");
	printf ("A、充满热忱，有很多想法且很有灵性.\nB、心思细腻，完美精确，而且为人可靠。\nC、坚强而直截了当，而且有推动力。 　\nD、有耐心，适应性强而且善于协调。\n");
	scanf ("%c",&v[12]);
	scanf ("%c",&ch[12]);
	printf ("your choice is %c\n",v[12]);
	printf ("14、 我过往的老师最有可能对我的评价是： 　\n");
	printf ("A、情绪起伏大，善于表达和抒发情感。\nB、严格保护自己的私密，有时会显得孤独或是不合群。\n C、动作敏捷又独立，并且喜欢自己做事情。\nD、看起来安稳轻松，反应度偏低，比较温和.	\n");
	scanf ("%c",&v[13]);
	scanf ("%c",&ch[13]);
	printf ("your choice is %c\n",v[13]);
	printf ("15、 朋友对我的评价最有可能的是： \n");
	printf ("A、喜欢对朋友述说事情，也有能量说服别人去做事。 \nB、能够提出很多周全的问题，而且需要许多精细的解说。\n C、愿意直言表达想法，有时会直率而犀利地谈论不喜欢的人、事、物。\n D、通常与他人一起是多听少说。\n");
	scanf ("%c",&v[14]);
	scanf ("%c",&ch[14]);
	printf ("your choice is %c\n",v[14]);
	printf ("16、 在帮助他人的问题上，我内心的想法是： \n");
	printf ("A、别人来找我，不太会拒绝，会尽力帮他。 \n　B、值得帮助的人应该帮助。 　\nC、很少承诺要帮，但我若承诺必兑现。\n D、虽无英雄打虎胆，常有自告奋勇心。	\n");
	scanf ("%c",&v[15]);
	scanf ("%c",&ch[15]);
	printf ("your choice is %c\n",v[15]);
	printf ("17、 面对他人对自己的赞美，我内心： \n");
	printf ("A、没有也无所谓，特别欣喜那也不至于。\nB、我不需无关痛痒的赞美，宁可对方欣赏我的能力。\n C、思考对方的真实性或立即回避众人的关注.\nD、赞美多多益善，总是令人愉悦的。\n");
	scanf ("%c",&v[16]);
	scanf ("%c",&ch[16]);
	printf ("your choice is %c\n",v[16]);
	printf ("18、 面对生活，我更像：\n");
	printf ("A、随和派－外面的世界我无关，我觉得自己这样还不错。 \n　B、行动派－我不进步，别人就会进步，所以我必须不停地前进。\n C、分析派－在问题未发生之前，就该想好所有的可能.\nD、无忧派－每天的生活开心快乐最重要。\n");
	scanf ("%c",&v[17]);
	scanf ("%c",&ch[17]);
	printf ("your choice is %c\n",v[17]);
	printf ("19、 对于规则，我内心的态度是： \n");
	printf ("A、不愿违反规则，但可能因为松散而无法达到规则的要求。\nB、打破规则，希望由自己来制定规则而不是遵守规则。 　\nC、严格遵守规则，并且竭尽全力做到规则内的最好.\nD、不喜被规则束缚，不按规则出牌会觉得新鲜有趣。\n");
	scanf ("%c",&v[18]);
	scanf ("%c",&ch[18]);
	printf ("your choice is %c\n",v[18]);
	printf ("20、 我认为自己在行为上的基本特点是： 　\n");
	printf ("A、慢条斯理，办事按部就班，能与周围的人协调一致.\nB、目标明确，集中精力为实现目标而努力，善于抓住核心要点。\nC、慎重小心，为做好预防及善后，会不惜一切而尽心操劳。\nD、丰富跃动，不喜欢制度和约束，倾向于快速反应。\n");
	scanf ("%c",&v[19]);
	scanf ("%c",&ch[19]);
	printf ("your choice is %c\n",v[19]);
	printf ("21、 当我做错事时，我倾向于\n");
	printf ("A、害怕但表面不露声色。\nB、不承认而且辩驳，但内心自我批评。\n C、愧疚和痛苦，容易停留在压抑中。\nD、难为情，希望逃避别人的批评。\n");
	scanf ("%c",&v[20]);
	scanf ("%c",&ch[20]);
	printf ("your choice is %c\n",v[20]);
	printf ("22、 当结束一段刻骨铭心的感情时，我会： 　\n");
	printf ("A、非常难受，可是日子总还是要过的，时间会冲淡一切的.\nB、虽然觉得受伤，但一旦下定决心，就会努力把过去的影子摔掉。\n 　C、深陷在悲伤的情绪中，在相当长的时期里难以自拔，也不愿再接受新的人。\n D、痛不欲生，需要找朋友倾诉或者找渠道发泄，寻求化解之道。\n");
	scanf ("%c",&v[21]);
	scanf ("%c",&ch[21]);
	printf ("your choice is %c\n",v[21]);
	printf ("23、 面对他人的倾诉，我回顾自己大多时候本能上倾向于： 　\n");
	printf ("A、认同并理解对方感受。\nB、做出一些定论或判断。\nC、给予一些分析或推理。\nD、发表一些评论或意见。\n");
	scanf ("%c",&v[22]);
	scanf ("%c",&ch[22]);
	printf ("your choice is %c\n",v[22]);
	printf ("24、 我在以下哪个群体中交流较感满足？ 　\n");
	printf ("A、舒服轻松的氛围中，心平气和最终达成一致结论。\n　B、彼此展开充分激烈的辩论并有收获。\nC、有意义地详细讨论事情的好坏和影响.\nD、很开心并且随意无拘束地闲谈。\n");
	scanf ("%c",&v[23]);
	scanf ("%c",&ch[23]);
	printf ("your choice is %c\n",v[23]);
	printf ("25、 在内心的真实想法里，我觉得工作： 　\n");
	printf ("A、不必有太大压力，可以让我做我熟悉的工作就很不错。\n B、应该以最快的速度完成，且争取去完成更多的任务。\n C、要么不做，要做就做到最好。\nD、如果能将乐趣融合在里面那就太棒了，不过如果不喜欢的工作实在没劲。\n");
	scanf ("%c",&v[24]);
	scanf ("%c",&ch[24]);
	printf ("your choice is %c\n",v[24]);
	printf ("26、 如果我是领导，我内心更希望在部属心目中，我是：\n");
	printf ("A、可以亲近的和善于为他们着想的。\nB、有很强的能力和富有领导力的。\nC、公平公正且足以信赖的。\nD、被他们喜欢并且觉得富有感召力的。\n");
	scanf ("%c",&v[25]);
	scanf ("%c",&ch[25]);
	printf ("your choice is %c\n",v[25]);
	printf ("27、 我对认同的需求是：\n");
	printf ("A、无论别人是否认同，生活都是要继续的。\nB、得到精英群体的认同最重要。\nC、只要我在乎的人认同就足够了。 \n　D、所见之人都可认同我那就太好了。\n");
	scanf ("%c",&v[26]);
	scanf ("%c",&ch[26]);
	printf ("your choice is %c\n",v[26]);
	printf ("28、 当我还是个孩子的时候，我： 　\n");
	printf ("A、不太会积极尝试新事物，通常比较喜欢旧有的和熟悉的。\n B、是孩子王，大家经常听我的决定。\n C、害羞见生人，有意识地回避。\n D、调皮可爱，乐观而又热心。	\n");
	scanf ("%c",&v[27]);
	scanf ("%c",&ch[27]);
	printf ("your choice is %c\n",v[27]);
	printf ("29、 如果我是父母，我也许是：\n");
	printf ("A、容易说服或者宽容的。\nB、比较严厉、性急及说一不二的。\n C、坚持自己的想法和比较挑剔的。\nD、积极参与到子女中一起玩，被小朋友们们热烈欢迎的。\n");
	scanf ("%c",&v[28]);
	scanf ("%c",&ch[28]);
	printf ("your choice is %c\n",v[28]);
	printf ("30、 以下有四组格言，哪组里符合我感觉的数目最多?\n");
	printf ("A、最深刻的真理是最简单和最平凡的。要在人世间取得成功必须大智若愚.好脾气是一个人在社交中所能穿着的最佳服饰。知足是人生在世最大的幸福。\nB、走自己的路，让人家去说吧。虽然世界充满了苦难，但是苦难总是能战胜的。有所成就是人生唯一的真正的乐趣。对我而言解决一个问题和享受一个假期一样好。\nC、一个不注意小事情的人，永远不会成功大事业。理性是灵魂中最高贵的因素。切忌浮夸铺张。与其说得过分，不如说得不全。谨慎比大胆要有力量得多。　\nD、与其在死的时候握着一大把钱，还不如活时活得丰富多彩。任何时候都要最真实地对待你自己，这比什么都重要。使生活变成幻想，再把幻想化为现实。幸福不在于拥有金钱，而在于获得成就时的喜悦以及产生创造力的激情.\n");
	scanf ("%c",&v[29]);
	scanf ("%c",&ch[29]);
	printf ("your choice is %c\n",v[29]);
	for(i=0;i<15;i++)
	{
		switch (v[i])
		{
			case 'A':A0 ++;break;
			case 'B':B0 ++;break;
			case 'C':C0 ++;break;
			case 'D':D0 ++;break;
		}
	}
	printf("前1~15题合计数:A的总数%d,B的总数%d,C的总数%d, D的总数%d\n",A0,B0,C0,D0);
	for (i=15;i<30;i++)
	{
		switch (v[i])
		{
			case 'A':A1 ++;break;
			case 'B':B1 ++;break;
			case 'C':C1 ++;break;
			case 'D':D1 ++;break;
		}
	}
	printf("前16~30题合计数:A的总数%d,B的总数%d,C的总数%d, D的总数%d\n",A1,B1,C1,D1);
	printf("性格色彩密码的总数：现在把两部分的数目汇总一起，你将得到你的性格色彩速写分数。\n红色：前A + 后D的总数%d\n蓝色：前B + 后C的总数%d\n黄色：前C + 后B的总数%d\n绿色：前D + 后A的总数%d\n总计：30\n",A0 + D1,B0 + C1,C0 + B1,D0 + A1);
	if(A0 +D1>=B0+C1 && A0 + D1 >= C0 + B1 && A0 + D1 >= D0 + A1)
		{printf( "红色：行动者\n红色性格的人是快节奏的人，会自发地行动和做出决策。他不关心事实和细节，并尽可能地逃避一些繁琐的工作。这种不遵循事实的特性经常会让他夸大其词。红色性格的人与分析研究相对比更喜欢随意猜测。他对组织活动充满兴趣，能够快速并热情地与人相处。红色性格的人一直追逐梦想，他有着不可思议的能力能够让别人和他一起实现梦想，他有非常强的说服能力。他一直寻求别人对他的成就给予赞扬。红色性格的人是很有创意的人，思维敏捷。红色的劣势是，会被人认为是主观的、鲁莽的、易冲动的。\n红色性格\n代表人物：徐志摩、郑钧\n天赋潜能：拥有高度乐观的积极心态，把生命当作值得享受的经验，容易受到人们的喜欢和欢迎。才思敏捷，善于表达，是演讲和舞台表演的高手。在工作中能够激发团队的热情和进取心，重视团队合作的感觉。\n本性局限：情绪波动大起大落，比较容易情绪控制人而非人控制情绪。口无遮拦，很难保守秘密，吹牛不打草稿，疏于兑现承诺。工作跳槽频率高，这山望着那山高，缺少规划，随意性强，计划不如变化快。\n实例分析：以红色的阳光心态来看，阿Q和鲁滨孙，这两个看上去风马牛不相及的人物都共同具备。只不过，前者是消极的，而后者是积极的。阿Q的精神胜利法，每每在遭受了无端屈辱，感到无可奈何时，利用这种方法来消除内心的痛苦，使自己快乐起来。而鲁先生一到荒岛，在克服了最初的绝望后，立即投入了征服大自然的革命中。应该承认，两种“阳光心态”的层次是不同的：阿Q在与现实相矛盾的虚拟世界中享受低层次的“阳光心态”；鲁滨孙在与现实相吻合的真实境界里享用高层次的“阳光心态”。如果你需要对这种健康和阳光的积极心态做一个彻底的感受，可以看看余华的小说《兄弟》上部，书中的父亲宋凡平堪称近乎经典的红＋黄的性格代表。\n");
		printf("＠红色优势＠\n1．阳光心态，积极快乐\n红色发明了飞机，蓝色发明了降落伞．红色发明了游艇，蓝色发明了救生圈．红色建造了高楼，蓝色生产了救火栓．红色发射了飞船，蓝色办了保险公司．\n如果说黄色的正面思考更加来源于他们”不服输”的动机，更加侧重在解决问题上．那么，红色的正面思考，更多地是因为他们天性习惯于”向往快乐和美好’的动机，更加侧重在精神层面上的鼓励和暗示．\n红色以喜悦拥抱每一件事情．健康的红色能在每件事情中看到美好的一面，即使是他们不理解或未曾思考过的事物都能使他们快乐．生命的黑暗和死亡的阴影，都无法令他们忧虑．奇妙的是，当他们对生命抱以开放和接受的态度而不苛求什么时，生命所带给他们的意义却更加丰富．\n2．澎湃，梦想万岁\n黄色的现实主义，在梦想中更加注重的是成功．蓝色的古典主义，有自己的梦想．绿色的稳定主义，更加宁愿不冒风险安于现状．红色的浪漫主义，更加看重的是人生的体验．\n3．热情开朗，喜欢交友\n在对于朋友的定义上，蓝色秉持的是”人生得一知己足矣！”的人生哲学．红色则更加宁愿是”普天之下，莫非我友”的人生态度． 对于大多销售人员来讲，红色早期上手更快，因为他们的人际关系富有宽度但偏浅．而蓝色在早期开拓不力，完全是因为他们在拓展人际关系的宽度上有着自己的困难，他们的人际关系是窄而深的路径．\n红色把幸福与快乐视为人生的目标．由于他们对事情总有很高的兴致，因此他们是令人愉快的伙伴．而且他们的活力与热情具有感染力，能够辐射到周围，和这样的人相处时，总是充满乐趣而且容易被他们活泼的精神所感动．\n4．童心未泯，富有趣味\n红色天性里对于快乐的向往，让他们可以用童心来欣赏一切，这种生活态度和哲学，将使他们不会复杂化．他们最懂得享受生命，不管他们从事的是什么，即便正在苦干，也显得似乎乐在其中，他们过日子秉持的信心就是－－－好的还没有到来．\n5．乐于助人，不记愁苦 有错就认，不记愁\n6．善于表达，调动气氛\n红色多见娱乐类的主持．兰色多见访谈类的主持．黄色多见记实类的主持．绿色多见播报类的主持．如果我们把”让他人心动”的能力界定为感染力，而把”让他人行动”的能力界定为影响力，那感染里更多是来源于红色，而影响力更多则来自于黄色．\n7．真诚信任，感染四方 红色是天生的激励者\n当红色给予某个人高期望和高鼓励时，他往往会实现那些期望的．\n");
		printf("8．乐在变化，创新意识 亢奋天天都有，各有巧妙不同\n红色比其他性格更容易去改变，因为他们喜欢新主意，新思想，新事物，还因为他们在变化和创造过程中得到无限的乐趣，由于这个世界是无穷的，所以他们能够一再地经历这种狂喜．\n＠（红色的天然优势）＠\n作为个体 高度乐观的积极心态 把生命当作值得享受的经验 喜欢新鲜，变化和刺激 喜欢开玩笑和调侃 经常开心，追求快乐 情感丰富而外露 天真有童心，富有趣味 自由自在，不受拘束 表现力强 容易受到人们的喜欢和欢迎 生动活泼，好奇心强\n沟通特点 才思敏捷，善于表达喜欢通过肢体上的接触表达亲密情感 容易与人攀谈 发生冲突时，能直接表白人越多越亢奋 演讲和舞台表演的高手 乐于表达自己的看法\n作为朋友 真诚主动，热情洋溢 喜欢交友，善于与陌生人互动 擅长搞笑，是带来乐趣的伙伴 容易原谅自己和别人，不记仇 富有个人魅力 有错就认，很快道歉 喜欢接受别人的肯定和不吝赞美\n对待工作和事业 工作主动，寻找新任务 富有感染力，能够吸引他人参与\n激发团队的热情合作心和进取心，重视团队合作的感觉 令人愉悦的工作伙伴\n打破沉闷工作环境的开心果 常在紧张气氛下展现幽默与化解冲突的能力\n完成短期目标时，极富爆发力 信任他人 善于赞美和鼓励，是天生的激励者\n不喜欢太多的规定束缚，富有创意 工作以活泼化，丰富化的方式进行\n善于作秀以增添企业形象 积极，充满干劲 反应快，闪电般开始\n");}
		else if (B0 + C1 >= A0 + D1 && B0 + C1 >= C0 + B1 && B0 + C1 >= D0 + A1)
		{printf("蓝色：思想者\n蓝色性格的人注重思考过程，能够全面、系统性的解决问题。他非常关心事物的安全性，任何事情都追求正确无误。所以这种人热衷于收集数据，询问很多有关于细节的问题。他的行动和决策都是非常谨慎的。蓝色性格的人做事缓慢，要求准确，喜欢有组织、有构架的，知识性的工作环境。这种性格的人比较容易多疑，且喜欢将事情记录下来。蓝色虽然是一个很好的问题解决者，但同时又是一个并不果断的决策者。当需要作决策时，他往往为了收集数据耽误了时间，经常性被他们引以为豪的口头禅是：“你不可能只掌握一半的数据就做出一项重要的决定吧。”蓝色的劣势是，会被认为是有距离的、挑剔的，和严肃的。\n");
		printf("蓝色性格\n代表人物：林黛玉、梁朝伟\n天赋潜能：思想深邃，独立思考而不盲从，坚守原则，责任心强。能记住谈话时共鸣的感情和思想，享受敏感而有深度的交流，默默地为他人付出以表示关切和爱。做事之前首先计划，且严格地按照计划去执行，强调制度、程序、规范、细节和流程。\n本性局限：太在意别人的看法和评价，容易被负面评价中伤。不太主动与人沟通，以为别人能够读懂自己的心思。过度敏感有时很难相处，对自己和他人常寄予过高而且不切实际的期望。\n实例分析：“请让我一个人呆着。”———在嘉宝的每部电影中，观众都能找到这样一句台词。在她的访谈录中，她说：“我自认为最幸福的时刻是一个人，或者和少数几个朋友在一起。”在好莱坞拍戏16年，嘉宝接连地搬过11次家，她避世的风格反而令媒体对她的追踪变本加厉……他们评选“嘉宝、卓别林和米老鼠” 为世界上最伟大的三个演员。\n");
		printf("＠蓝色优势＠\n1．思想深邃，独立思考 2．成熟稳重，安全放心\n红色喜欢刺激．蓝色喜欢安全．黄色喜欢挑战．绿色喜欢稳定．\n3．情感细腻，体贴入微 4．一诺千金，忠诚情谊\n因为他们在承诺上的高度注重和甘愿以生命来维护的态度，蓝色得以成为四种性格中最值得信任的人群．\n蓝色对人忠诚，黄色对事忠诚．蓝色对人负责，黄色对事负责．蓝色富有责任心，黄色富有责任感．\n5．计划周详，注重规则\n”做任何事情首先指定好计划，然后严格地按照计划去执行”，也许这是蓝色做事的原则中仅次于”要么不做，要做就做到最好”最高座右铭只后的第二准则．\n红色喜欢变化中新奇的不确定的快乐，而蓝色喜欢计划中程序的安全感和稳定．\n黄色：用什么猫捉不重要，捉到老鼠最重要．蓝色：捉到老鼠很重要，用什么猫捉和怎么捉的同样重要．红色：捉老鼠并不重要，捉老鼠好不好玩最重要．绿色：你们嫌不嫌烦啊，老鼠不去管它，放在那里不是也蛮好的吗？\n红色：不喜欢被规则束缚的人，偶尔不按规则出牌会觉得新鲜有趣．黄色：打破规则的人，他们更希望由自己来制定规则而不是遵守规则．绿色：害怕违反规则的人，但绿色可能因为懒散而无法达到规则的要求．蓝色：最遵守规则的人，并且竭尽全力作到规则内的最好．\n6．讲究精确，迷恋细节\n蓝色是完美主义者，他们希望成为最好，找到最好，并且努力做到最好．他们辛劳地努力工作，喜欢做高质量的工作，即使这以为着要花更长的时间，付出艰巨的努力，也在所不惜．对于他们来将，如果这个事情值得做，那就一定要做到最好．任何的松懈和放低标准让他们感到自己良心的谴责，那将是一种奇耻大辱．\n7．考虑全面，善于分析\n蓝色是最有潜力成为理财高手的人．\n当黄色力图用最简捷的方法解决最复杂的问题时，蓝色也许正在用最复杂的方法诠释见得问题以确保周详和严谨．而正是如此，他们经常运用现有的一个观点并使他发展，他们具有发明家的思想和本领．因此，黄色是把复杂问题简单化，兰色可把简单问题复杂化．\n8．执着有恒，坚持到底\n红色要大快乐，但是小快乐一个也不能少．而蓝色如果有大快乐，小快乐我宁可一个都不要．\n");
		printf("＠蓝色的天然优势＠\n作为个体 严肃的生活哲学 思想深邃，独立思考而不盲从 沉默寡言，老成持重 注重承诺可靠安全 谨慎而深藏不露 坚守原则，责任心强 遵守规则，井井有条 深沉的理想主义者 敏感细腻 高标准，追求完美 谦和稳健 善于分析，富有条理 待人忠诚，富有自我牺牲精神 深思熟虑，三思而后行 坚韧执着\n沟通特点 享受敏感而有深度的交流 设身处地地体会他人 能记住谈话时共鸣的感情和思想 喜欢小群体叫的思想碰撞 关注谈话的细节\n作为朋友 默默地为他人付出以表示关切和爱 对友谊忠诚不渝 真诚关怀朋友的境遇，善于体贴他人 能够记得特殊的日子 遭遇难关时，极力给予鼓舞和安慰 很少向他人表达内心的看法 经常扮演问题分析的角色\n对待工作和事业 强调制度，程序，规范，细节和流程 做事之前首先计划，且严格地按照计划去执行 喜欢探究及根据事实行事 尽忠职守，追求卓越 高度自律喜欢用表格，数字的管理来验证效果 注重承诺 一丝不苟地执行工作.\n");}
		else if (C0 + B1 >= A0 + D1 && C0 + B1 >= B0 + C1 && C0 + B1 >= D0 + A1)
		{printf(" 黄色：领导者\n黄色性格的人是非常直接的，同时也很严谨。黄色性格的人善于控制他人和环境，果断行动和决策。这种性格的人行动非常迅速，对拖延非常没有耐心。当别人不能跟上他们的节奏，他会认为他们没有能力。黄色性格的人的座右铭是“我要做得又快又好”。黄色性格的人是典型的执行者，他们有很强的自我管理能力，他们自觉完成工作并给予自己新的任务。黄色性格的人喜欢同时做很多事情。他可以同时做三件事，并尽可能做第四件事。他会持续给自己加压一直到自己无法承受的最高点，之后稍事放松。然而很快他又会重新开始整个进程。不过，和别人交往时，黄色的劣势是，常常表现冷漠，以产出和目标为导向，更关心最后的结果，会被认为是固执、缺乏耐心、强硬和专横。\n");
		printf("黄色性格\n代表人物：麦当娜、萨达姆\n天赋潜能：把生命当成竞赛，自信、不情绪化，而且非常有活力，敢于接受挑战并渴望成功。说话用字简明扼要，不喜欢拐弯抹角，直接抓住问题的本质。能够承担长期高强度的压力，善于快速决策并处理所遇到的一切问题。\n本性局限：在情绪不佳或有压力的时候，经常会不可理喻与独断专行。毫无敏感，难以洞察他人内心和理解他人所想，态度尖锐严厉，批判性强。对于竞争结果过分关注而忽略了过程中的乐趣。\n实例分析：悟空（黄＋红）是石头蹦出来的猴子，据说是日月孕育出来的，这样一个没家的野孩子，没有家族权威的羁绊，他的童年就是顽劣生事的童年。学得七十二变诸般本领后，他造反的矛头首先对准的就是更大的家———神仙世界的统治者。他大闹龙宫和天宫，去阎王殿将自己除名，正是表明原本是一个彻底的自由身，无论最高统治者玉帝也罢，还是手握生死的阎王也罢，种种的权威在他看来都应该被他打倒。\n我们可以看到在黄色的精神世界里是没有“权威”二字的。有趣的是，一方面黄色希望人们把他们看成是权威，对他们无比尊重甚至内心崇拜；另一方面他们本身却将“权威”当成是牛鬼蛇神一样地鄙视在脚下。真是一个有趣的矛盾！\n");
		printf("＠黄色优势＠\n1．目标导向，永无止境\n以目标和结果为导向，不达目的，誓不罢休，是黄色从来就知道的．\n信念的坚持，至少也是生命延续的理由．虽然黄色和兰色都是坚持，但在信念的坚持上，黄色仍比兰色要做的出色．\n黄色似乎很少有知足的时候，他们总是给自己定下一个又一个的目标去达成．成大事的黄色，都不能容忍平淡无奇的生活状态，渴望体验斗争的乐趣．\n黄色是四种人当中最有工作狂倾向的人． 红色：今朝有酒今朝醉，明日再担明日忧．兰色：天下本无事，庸人自扰之．黄色：居安思危，不进则退．绿色：无论风吹雨打，我自巍然不动．\n2．求胜欲望，战胜对方\n你不得不佩服黄色人的坚定和执着，他们希望能够战胜别人，让别人服输的那种欲望几乎纵贯他们整个生命的任何一个细节．黄色天性中流动着西班牙斗牛的血液，在与天斗，与人斗，与己斗的过程中他们体验到自己人生的价值．\n3．斗天斗地，敢说敢做\n一旦黄色的想法遭到反对时，那只会激发起他们加倍的努力和挑战欲．当红色已经跑到其他地方，绿色停止不前，兰色已经考虑是否要转移****时，黄色只会更加努力全力以赴地向前冲．就像一个电动玩具的机器人，当走到一堵墙面前，他们仍旧直行，企图穿越，与其改变方向或者计划，还不如把挡路饿墙给废掉，这就是他们的逻辑．\n4．坚定自信，永不言败\n黄色对于目标的执着，让他们认定逆境是一个伟大的教师，他们笃信着那些一生都走着平坦大道的人是培养不出力量的．黄色性格通过逆着潮流而不是顺着潮流游泳，来培养出他们的力量．也许着就是所谓的”越挫越勇”\n5．控制情绪，抗压力强\n黄色告诉我们”受苦的人没有悲观的权利，远征的人没有流泪的资格．\n黄色不受情感干扰的能力，在推进事业的过程中尤其重要．\n6．坦率直接，实用主义\n即使对自己喜欢的人黄色也不是通过柔和的语言来传达，而是以行动保护对方来表达自己的情感．他们认为支撑爱情的是责任，爱情就是保护对方，给对方提供安全，其他都是没有实际意义的．\n使用注意往往引导黄色以最直接便捷，浅显明了的方式来说明和阐释或玄奥或重大的问题．\n7．快速决断，敢冒风险\n工作能力对于黄色来说，是他们的财富和责任．从商业的角度来看，追求进步和成功使黄色的人成为成功路上的王者，他们比其他性格更容易迅速取得胜利．\n");
		printf("8．抓大放小，高效行动\n黄色做决定不费力，归根结底，完全是因为他永远知道，什么才是最重要的．他们能够放大抓小，永远关注结果．\n只要有什么新想法，立刻就会付诸实行．这样的行动力是黄色的能量所赐，同时也起到了消除忧郁的作用。他们的日程表总是排的满满的，工作以外的时间会被旅行，运动等活动填满，什么也不做的空闲时间，对他们来说，不仅非常不健全，甚至还是一种KB．\n");
		printf ("＠黄色的天然优势＠\n作为个体 不达目标誓不罢休 自信，不情绪化，而且非常有活力 坦率，直截了当，一针见血 强烈的进取心，居安思危 独立性强 有强烈的求胜欲 危难时刻挺身而出 不易气馁，不在乎外界的评价，坚持自己所选择的道路和方向 敢于接受挑战并渴望成功\n沟通特点 以务实的方式主导会谈 喜欢主导整个事情进行的方式 能够直接抓住问题的本质 说话用字简明扼要，不喜欢拐弯抹角 不受情绪干扰和控制\n作为朋友 给予解决问题的方法，而非纠缠在过去 迅速提出忠告和方向 直言不讳地提出建议\n对待工作和事业 动作干净利落，讲求效率 能够承担长期高强度的压力 强烈的目标趋向，善于设定目标 寻求实际的解决方法 高瞻远瞩，有全局观念 善于委派工作 坚持不懈，促成活动 掌握重点执行 行事作风明快 天生的领导者能力 竞争越强，精力越旺，愈挫愈勇 以结果和完成任务为导向，并且高效率善于快速决策并处理所遇到的一切问题 富有责任感\n");}
		else
		{printf("绿色：和平者\n绿色性格的人追求安全感和归属感，和蓝色一样做事和决策慢，不同的是这种拖延是因为绿色性格的人不愿冒风险。在他行动或作决策之前，他希望能够先了解别人的感受。绿色性格的人是四种性格中最以人际为导向的人。对这种性格最适合的形容词是亲近的、友好的。绿色性格的人不喜欢与人发生冲突，所以有时他会说别人想听的话而不是他心里想的话。绿色性格的人有很强的劝说能力，非常愿意支持其他人。他也是一个积极的聆听者。作为他的伙伴你会感觉很舒服。因为绿色性格的人很愿意听别人说，因此轮到他说的时候，别人也愿意听他说，因此他有很强的能力获得别人的支持。绿色的劣势是，会被人认为过于温和，心肠太软，老好人。\n");
		printf("绿色性格\n代表人物：孔子、葛优\n天赋潜能：天性和善，做人厚道，有温柔祥和的吸引力和宁静愉悦的气质。善于接纳他人意见，是最佳的倾听者，极具耐心。能接纳所有不同性格的人，处处为别人考虑，不吝付出。对待工作以人为本，尊重员工和同事的独立性。\n本性局限：按照惯性来做事，拒绝改变，对于外界变化置若罔闻，太在意别人的反应，不敢表达自己的立场和原则。期待事情会自动解决，完全守望被动，把压力和负担通通转嫁到他人身上。\n");
		printf ("＠绿色的天然优势＠\n作为个体 爱静不爱动，有温柔祥和的吸引力和宁静愉悦的气质 和善的天性，做人厚道 追求人际关系的和谐 奉行中庸之道，为人稳定低调 遇事以不变应万变，镇定自若 知足常乐，心态轻松 追求平淡的幸福生活 有松弛感，能融入所有的环境和场合 从不发火，温和，谦和，平和 做人懂得”得饶人处且饶人”最求简单随意的生活方式\n沟通特点 以柔克刚，不战而屈人之兵 避免冲突，注重双赢 心平气和且慢条斯理 善于接纳他人意见 最佳的倾听者，极具耐心 擅长让别人感觉舒适 有自然和不经意的冷幽默 松弛大度，不急不徐\n作为朋友 从无攻击性 富有同情心和关心 宽恕他人对自己的伤害能接纳所有不同性格的人 河山的天性及圆滑的手腕 对友情的要求不严苛 ?处处为别人考虑，不吝付出 与之相处轻松自然有没有压力 从不尝试去改变他人\n对待工作和事业 高超的协调人际关系的能力 善于从容地面对压力 巧妙地化解冲突 缓步前进以取得思考空间 注重人本管理 善于为别人着想 一团体为导向 创造稳定性 用自然低调的行事手法处理事务\n");}
	return 0;
}
